In [1]:
import pandas as pd

In [4]:
df = pd.DataFrame({
    'c1':[1,2,3,4],
    'c2':[444,555,666,444],
    'c3':['abc','def','fgh','fgt']
})

In [5]:
df

   c1   c2   c3
0   1  444  abc
1   2  555  def
2   3  666  fgh
3   4  444  fgt

In [6]:
def times2(x):return x * 2

In [10]:
df['c1'].apply(lambda x:x*3)

0     3
1     6
2     9
3    12
Name: c1, dtype: int64

In [11]:
df['c3'].apply(len)

0    3
1    3
2    3
3    3
Name: c3, dtype: int64

In [16]:
df['c2'].apply(lambda x:x//11,)

0    444
1    555
2    666
3    444
Name: c2, dtype: int64

In [17]:
df

   c1   c2   c3
0   1  444  abc
1   2  555  def
2   3  666  fgh
3   4  444  fgt

In [26]:
df.sort_values(by='c3',kind='mergesort')

   c1   c2   c3
0   1  444  abc
1   2  555  def
2   3  666  fgh
3   4  444  fgt

In [27]:
df.dropna() # Drop rows with NaN values

   c1   c2   c3
0   1  444  abc
1   2  555  def
2   3  666  fgh
3   4  444  fgt

In [29]:
import numpy as np
df1 = pd.DataFrame({'c1':[1,2,np.nan],'c2':[np.nan,3,4]})

In [30]:
df1

    c1   c2
0  1.0  NaN
1  2.0  3.0
2  NaN  4.0

In [31]:
df1.fillna(0)

    c1   c2
0  1.0  0.0
1  2.0  3.0
2  0.0  4.0

In [40]:
df = pd.read_excel('Excel_Sample.xlsx',sheet_name="Sheet1") # for output to csv = to_csv('name') /read_csv()

In [41]:
df.head()

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [42]:
df.to_csv('example.csv',index=False)

In [52]:
df =pd.read_csv('user.csv')

In [56]:
df.to_csv('moviedataset',index=False)

In [59]:
round(0.5) - round(-0.5)

0

In [60]:
print('%d %s %g'%(1,'hello',4.0))

1 hello 4